<?php

return [
    /*
    |--------------------------------------------------------------------------
    | Языковые ресурсы для проверки значений
    |--------------------------------------------------------------------------
    |
    | Последующие языковые строки содержат сообщения по-умолчанию, используемые
    | классом, проверяющим значения (валидатором). Некоторые из правил имеют
    | несколько версий, например, size. Вы можете поменять их на любые
    | другие, которые лучше подходят для вашего приложения.
    |
    */

    'accepted'             => 'Ви повинні прийняти :attribute',
    'active_url'           => 'Полі :attribute містить недійсний URL',
    'after'                => 'В полі :attribute повинна бути дата більше :date',
    'after_or_equal'       => 'В полі :attribute повинна бути дата більше або рівнятись :date',
    'alpha'                => 'Поле :attribute може містити тільки літери',
    'alpha_dash'           => 'Поле :attribute може містити тільки літери, цифри, дефіс та нижнє підкреслювання',
    'alpha_num'            => 'Поле :attribute може містити тільки букви і цифри',
    'array'                => 'Поле :attribute має бути масивом',
    'before'               => 'В полі :attribute повинна бути дата раніше :date',
    'before_or_equal'      => 'В полі :attribute повинна бути дата раніше або дорівнювати :date',
    'between'              => [
        'numeric' => 'Поле :attribute має бути між :min і :max',
        'file'    => 'Розмір файлу в полі :attribute повинен бути між :min і :max Кілобайтів(а)',
        'string'  => 'Кількість символів в полі :attribute має бути між :min і :max',
        'array'   => 'Кількість елементів в полі :attribute має бути між :min і :max',
    ],
    'boolean'              => 'Поле :attribute повинно мати значення логічного типу',
    'confirmed'            => 'Поле :attribute не збігається з підтвердженням',
    'date'                 => 'Поле :attribute не є датою',
    'date_equals'          => 'Поле :attribute має бути датою рівною :date',
    'date_format'          => 'Поле :attribute не відповідає формату :format',
    'different'            => 'Поля :attribute і :other повинні відрізнятися',
    'digits'               => 'Довжина цифрового поля :attribute повинна бути :digits',
    'digits_between'       => 'Довжина цифрового поля :attribute повинна бути між :min і :max',
    'dimensions'           => 'Поле :attribute має неприпустимі розміри зображення',
    'distinct'             => 'Поле :attribute містить повторюване значення',
    'email'                => 'Поле :attribute має бути дійсною електронною адресою',
    'ends_with'            => 'Поле :attribute має закінчуватися одним з наступних значень: :values',
    'exists'               => 'Вибране значення для :attribute некоректне',
    'file'                 => 'Поле :attribute повинно бути файлом',
    'filled'               => 'Поле :attribute обов\'язкове для заповнення',
    'gt'                   => [
        'numeric' => 'Поле :attribute має бути більше :value',
        'file'    => 'Розмір файлу в полі :attribute повинен бути більше :value Кілобайтів (а)',
        'string'  => 'Розмір файлу в полі :attribute повинен бути більше :value Кілобайтів (а)',
        'array'   => 'Кількість елементів в полі :attribute має бути більше :value',
    ],
    'gte'                  => [
        'numeric' => 'Поле :attribute має бути :value або більше',
        'file'    => 'Розмір файлу в полі :attribute повинен бути :value Кілобайтів (а) або більше',
        'string'  => 'Кількість символів в полі :attribute має бути :value або більше',
        'array'   => 'Кількість елементів в полі :attribute має бути :value або більше',
    ],
    'image'                => 'Поле :attribute має бути зображенням',
    'in'                   => 'Вибране значення для :attribute помилково',
    'in_array'             => 'Поле :attribute не існує в :other',
    'integer'              => 'Поле :attribute має бути цілим числом',
    'ip'                   => 'Поле :attribute должно быть действительным IP-адресом',
    'ipv4'                 => 'Поле :attribute должно быть действительным IPv4-адресом',
    'ipv6'                 => 'Поле :attribute должно быть действительным IPv6-адресом',
    'json'                 => 'Поле :attribute должно быть JSON строкой',
    'lt'                   => [
        'numeric' => 'Поле :attribute має бути менше :value',
        'file'    => 'Розмір файлу в полі :attribute повинен бути менше :value Кілобайтів (а)',
        'string'  => 'Кількість символів в полі :attribute має бути менше :value',
        'array'   => 'Кількість елементів в полі :attribute має бути менше :value',
    ],
    'lte'                  => [
        'numeric' => 'Поле :attribute має бути :value або менше',
        'file'    => 'Розмір файлу в полі :attribute повинен бути :value Кілобайтів (а) або менше',
        'string'  => 'Кількість символів в полі :attribute має бути :value або менше',
        'array'   => 'Кількість елементів в полі :attribute має бути :value або менше',
    ],
    'max'                  => [
        'numeric' => 'Поле :attribute не може бути більше :max',
        'file'    => 'Розмір файлу в полі :attribute не може бути більше :max Кілобайтів (а)',
        'string'  => 'Кількість символів в полі :attribute не може перевищувати :max',
        'array'   => 'Кількість елементів в полі :attribute не може перевищувати :max',
    ],
    'mimes'                => 'Поле :attribute має бути файлом одного з наступних типів: :values',
    'mimetypes'            => 'Поле :attribute має бути файлом одного з наступних типів: :values',
    'min'                  => [
        'numeric' => 'Поле :attribute має бути не менше :min',
        'file'    => 'Розмір файлу в полі :attribute повинен бути не менше :min Кілобайтів (а)',
        'string'  => 'Кількість символів в полі :attribute має бути не менше :min символів',
        'array'   => 'Кількість елементів в полі :attribute має бути не менше :min елементів',
    ],
    'multiple_of'          => 'Значення поля :attribute має бути кратним :value',
    'not_in'               => 'Вибране значення для :attribute помилково',
    'not_regex'            => 'Обраний формат для :attribute помилковий',
    'numeric'              => 'Поле :attribute має бути числом',
    'password'             => 'Невірний пароль',
    'present'              => 'Поле :attribute повинне бути присутнім',
    'regex'                => 'Поле :attribute має хибний формат',
    'required'             => 'Поле :attribute обов\'язкове для заповнення',
    'required_if'          => 'Поле :attribute обов\'язкове для заповнення, коли :other равно :value',
    'required_unless'      => 'Поле :attribute обов\'язкове для заповнення, коли :other не равно :values',
    'required_with'        => 'Поле :attribute обов\'язкове для заповнення, коли :values указано',
    'required_with_all'    => 'Поле :attribute обов\'язкове для заповнення, коли :values указано',
    'required_without'     => 'Поле :attribute обов\'язкове для заповнення, коли :values не указано',
    'required_without_all' => 'Поле :attribute обов\'язкове для заповнення, коли ни одно из :values не указано',
    'same'                 => 'Значення полів :attribute і :other повинні збігатися',
    'size'                 => [
        'numeric' => 'Поле :attribute має бути рівним :size',
        'file'    => 'Розмір файлу в полі :attribute має дорівнювати :size Кілобайтів (а)',
        'string'  => 'Кількість символів в полі :attribute має бути рівним :size',
        'array'   => 'Кількість елементів в полі :attribute має бути рівним :size',
    ],
    'starts_with'          => 'Поле :attribute має починатися з одного з наступних значень: :values',
    'string'               => 'Поле :attribute має бути рядком',
    'timezone'             => 'Поле :attribute має бути дійсним годинним поясом',
    'unique'               => 'Таке значення поля :attribute вже існує',
    'uploaded'             => 'Завантаження поля :attribute не вдалася',
    'url'                  => 'Поле :attribute має хибний формат URL',
    'uuid'                 => 'Поле :attribute має бути коректним UUID',

    /*
    |--------------------------------------------------------------------------
    | Собственные языковые ресурсы для проверки значений
    |--------------------------------------------------------------------------
    |
    | Здесь Вы можете указать собственные сообщения для атрибутов.
    | Это позволяет легко указать свое сообщение для заданного правила атрибута.
    |
    | http://laravel.com/docs/validation#custom-error-messages
    | Пример использования
    |
    |   'custom' => [
    |       'email' => [
    |           'required' => 'Нам необходимо знать Ваш электронный адрес!',
    |       ],
    |   ],
    |
    */

    'custom' => [
        'attribute-name' => [
            'rule-name' => 'custom-message',
        ],

        'email' =>[
            'unique' => 'Логін уже існує',
            'exists' => 'Обліковий запис з таким email не знайдено'
        ],
        'password' => [
            'confirmed' => 'Паролі не збігаються'
        ]
    ],

    /*
    |--------------------------------------------------------------------------
    | Собственные названия атрибутов
    |--------------------------------------------------------------------------
    |
    | Последующие строки используются для подмены программных имен элементов
    | пользовательского интерфейса на удобочитаемые. Например, вместо имени
    | поля "email" в сообщениях будет выводиться "электронный адрес".
    |
    | Пример использования
    |
    |   'attributes' => [
    |       'email' => 'электронный адрес',
    |   ],
    |
    */

    'attributes' => [
        'name'                  => 'Ім\'я',
        'username'              => 'Нікнейм',
        'email'                 => 'E-Mail адреса',
        'first_name'            => 'Ім\'я',
        'last_name'             => 'Прізвище',
        'password'              => 'Пароль',
        'password_confirmation' => 'Підтвердження пароля',
        'current_password'      => 'Поточний пароль',
        'city'                  => 'Місто',
        'country'               => 'Країна',
        'address'               => 'Адреса',
        'phone'                 => 'Телефон',
        'mobile'                => 'Моб. номер',
        'age'                   => 'Вік',
        'sex'                   => 'Стать',
        'gender'                => 'Стать',
        'day'                   => 'День',
        'month'                 => 'Місяць',
        'year'                  => 'Рік',
        'hour'                  => 'Година',
        'minute'                => 'Хвидина',
        'second'                => 'Секунда',
        'title'                 => 'Назва',
        'content'               => 'Контент',
        'description'           => 'Опис',
        'excerpt'               => 'Витримка',
        'date'                  => 'Дата',
        'time'                  => 'Час',
        'available'             => 'Доступно',
        'size'                  => 'Розмір',
        'social_links'          => 'Профіль у соцмережах',
        'type'                  => 'Тип',
        'social_links.new.*.link' => 'Профіль у соцмережах',
        'social_links.old.*.link' => 'Профіль у соцмережах',
        'text'                    => 'Текст'
    ],
];
